Revit 2027 API
MEPAnalyticalNode.IsSameNode Method
 Verify if this node is connected to the other node and thus represents the same analytical node in the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSameNode(
	MEPAnalyticalNode other
)
Public Function IsSameNode (
	other As MEPAnalyticalNode
) As Boolean
public:
bool IsSameNode(
	MEPAnalyticalNode^ other
)
member IsSameNode :
        other : MEPAnalyticalNode -> bool
Parameters
other MEPAnalyticalNode
 The other node to be compared.
Return Value
Boolean
 True if two nodes represent the same node of the network. Otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace